{
  "posts": [
    {
      "id": 1,
      "title": "Анчартед: На картах не значится",
      "descr": "Два искателя приключений Нейтан Дрейк и Виктор Салливан по прозвищу Салли отправляются на поиски величайшего сокровища мира. Кроме того, они надеются найти улики, которые приведут их к давно потерянному брату Нейтана.",
      "img": "./img/Боевики/img2.jpg",
      "category": 2
    },
    {
      "id": 2,
      "title": "Дневная смена",
      "descr": "История трудолюбивого отца, который пытается обеспечить лучшую жизнь 8-летней дочери. Вот только его дневная работа уборщиком бассейнов — лишь прикрытие. Он зарабатывает, выслеживая и убивая вампиров.",
      "img": "./img/Ужастики/img1.jpg",
      "category": 3
    },
    {
      "id": 3,
      "title": "Заговор в Голливуде",
      "descr": "Человек, вовлеченный в тройное убийство голливудских звезд, начинает собственное расследование. Нуждаясь в помощи, он нанимает двух детективов, чтобы разоблачить заговор, уровень опасности которого они и представить себе не могли.",
      "img": "./img/Боевики/img4.jpg",
      "category": 2
    },
    {
      "id": 4,
      "title": "Суперагенты",
      "descr": "Комедия о парне со странными позывными Матильда, который мечтает стать секретным агентом. Босс Матильды генпрокурор дает ему деликатное задание – вернуть сбежавшую дочь Сафию из Дубая. Для выполнения этого задания, Матильда берет с собой своего брата Секу, который не в восторге от его предложения, но тем не менее соглашается сопровождать Матильду как казалось бы в таком не сложном деле. Но они даже не подозревали, что ждет их во время этой спасательной операции.",
      "img": "./img/Комедии/img5.jpg",
      "category": 4
    },
    {
      "id": 6,
      "title": "Иностранец",
      "descr": "Бывший спецагент, ветеран вьетнамской войны Цюань давно сложил оружие и завел мирную жизнь. Но после того, как в теракте прямо на глазах погибает его дочь-подросток, видя, что власти не спешат разыскивать преступников, Цюань сам начинает поиск убийцы. Он пойдет на все, чтобы совершить праведное возмездие…",
      "img": "./img/Боевики/img7.jpg",
      "category": 2
    },
    {
      "id": 7,
      "title": "Час пик 3",
      "descr": "Лос-анджелесского полицейского Джеймса Картера, допустившего грубую ошибку при аресте подозреваемого, переводят на гораздо менее престижную должность в дорожной полиции. Тем временем гонконгский полицейский инспектор Ли получает спецзадание: он должен охранять китайского посла Хана, который направляется в Лос-Анджелес, чтобы произнести там речь на саммите Всемирного уголовного суда.Хан намеревается разоблачить интриги китайской Триады — самого опасного криминального синдиката в мире — и вывести на чистую воду преступных боссов. Представители Триады, разумеется, не дремлют. Они отправляют в Лос-Анджелес наемного убийцу, которому удается ранить посла в тот самый момент, когда он начинает произносить свою разоблачительную речь. Ли бросается вдогонку за преступником. Тем временем Картер, услышав по полицейскому радио сообщение о покушении на посла, мчится на место преступления… и, естественно, только путается под ногами у Ли.",
      "img": "./img/Комедии/img8.jpg",
      "category": 4
    },
    {
      "id": 8,
      "title": "Пираты Карибского моря: Проклятие Черной жемчужины",
      "descr": "Жизнь харизматичного авантюриста, капитана Джека Воробья, полная увлекательных приключений, резко меняется, когда его заклятый враг — капитан Барбосса — похищает корабль Джека, Черную Жемчужину, а затем нападает на Порт Ройал и крадет прекрасную дочь губернатора, Элизабет Свонн.      Друг детства Элизабет, Уилл Тернер, вместе с Джеком возглавляет спасательную экспедицию на самом быстром корабле Британии, в попытке вызволить девушку из плена и заодно отобрать у злодея Черную Жемчужину. Вслед за этой парочкой отправляется амбициозный коммодор Норрингтон, который к тому же числится женихом Элизабет.Однако Уилл не знает, что над Барбоссой висит вечное проклятие, при лунном свете превращающее его с командой в живых скелетов. Проклятье будет снято лишь тогда, когда украденное золото Ацтеков будет возвращено пиратами на старое место.",
      "img": "./img/Фантастика/img9.jpg",
      "category": 5
    },
    {
      "id": 9,
      "title": "Мир Юрского периода: Господство",
      "descr": "После уничтожения острова Нублар динозавры вырвались на свободу и заполнили планету. Людям удается поддерживать хрупкое равновесие, определяющее мирное сосуществование на Земле. Но как долго человек сможет сохранять свое господство, живя по соседству с самыми устрашающими существами в истории?",
      "img": "./img/Фантастика/img3.jpg",
      "category": 5
    },
    {
      "id": 10,
      "title": "Мстители: Финал",
      "descr": "Оставшиеся в живых члены команды Мстителей и их союзники должны разработать новый план, который поможет противостоять разрушительным действиям могущественного титана Таноса. После наиболее масштабной и трагической битвы в истории они не могут допустить ошибку.",
      "img": "./img/Фантастика/img10.jpg",
      "category": 5
    },
    {
      "id": 11,
      "title": "Холодная река",
      "descr": "Эрика Шоу получает очередной рабочий заказ — снять фильм об известном миллиардере Кэмпбелле Бредфорде. Она приезжает в город и останавливается в роскошном курортном отеле, который принадлежит Бредфорду. Но, оказавшись один на один с мрачными тайнами этого места, Эрика начинает осознавать, что в стенах местной гостиницы обитает необъяснимое зло.",
      "img": "./img/Ужастики/img11.jpg",
      "category": 3
    },
    {
      "title": "hhh",
      "descr": "test",
      "img": "https://www.realmadrid.com/StaticFiles/RealMadridResponsive/images/static/og-image.png",
      "id": 12
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Все"
    },
    {
      "id": 2,
      "name": "Боевики"
    },
    {
      "id": 3,
      "name": "Ужастики"
    },
    {
      "id": 4,
      "name": "Комедии"
    },
    {
      "id": 5,
      "name": "Фантастика/Фентези"
    }
  ]
}